# Brewfile for Room of Requirement CLI Tools Feature
# Default Homebrew bundle with essential development tools
# Users can override by placing their own Brewfile in project root

# ====================================
# CORE: Cloud-Native & Kubernetes (FR-030)
# ====================================
brew "kubectl"              # Kubernetes CLI
brew "helm"                 # Kubernetes package manager
brew "k9s"                  # Kubernetes cluster manager UI

# ====================================
# CORE: Universal CLI Tools (FR-030)
# ====================================
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "gh"                   # GitHub CLI

# ====================================
# Cloud & Infrastructure
# ====================================
brew "aws-cli"              # AWS command-line interface
brew "azure-cli"            # Azure command-line interface
brew "terraform"            # Infrastructure as code

# ====================================
# Git & Version Control
# ====================================
brew "git-lfs"              # Git Large File Storage

# ====================================
# Development Utilities
# ====================================
brew "ripgrep"              # Fast recursive grep (rg)
brew "fd"                   # Fast find alternative
brew "fzf"                  # Fuzzy finder
brew "bat"                  # cat with syntax highlighting
brew "eza"                  # Modern ls replacement
brew "tldr"                 # Simplified man pages
brew "httpie"               # User-friendly HTTP client

# ====================================
# System & Process Management
# ====================================
brew "htop"                 # Interactive process viewer
brew "tmux"                 # Terminal multiplexer
brew "tree"                 # Directory tree viewer

# ====================================
# Supply Chain Security (FR-018, FR-019, FR-021)
# ====================================
brew "cosign"               # Container image signing
brew "grype"                # CVE scanner for images
brew "syft"                 # SBOM generator

# ====================================
# Container & DevOps Tools
# ====================================
brew "podman"               # Container engine alternative
brew "skaffold"             # Kubernetes development

# ====================================
# Data & Development
# ====================================
brew "sqlite"               # Lightweight SQL database
brew "duckdb"               # Embedded analytics database

# ====================================
# Optional DevOps Tools (uncomment as needed)
# ====================================
# brew "docker"              # Docker CLI (if not using docker-in-docker)
# brew "docker-compose"      # Docker Compose
# brew "argocd"              # GitOps CD tool
# brew "flux"                # GitOps toolkit
# brew "kustomize"           # Kubernetes native config management
