# Room of Requirement DevContainer Brewfile
# On-demand installation via: ujust brew-install-all
# Tracked by maintenance-robot (see allowlists/homebrew.json)

# ============================================================================
# CORE: Development Tools
# ============================================================================
brew "dagger"              # Portable devkit for CI/CD pipelines
brew "devspace"            # Kubernetes development tool
brew "uv"                  # Fast Python package installer

# ============================================================================
# CORE: Cloud-Native & Kubernetes
# ============================================================================
brew "k3d"                 # k3s in Docker - local Kubernetes clusters
brew "kubernetes-cli"      # kubectl - Kubernetes CLI
brew "helm"                # Kubernetes package manager
brew "k9s"                 # Kubernetes TUI
brew "skaffold"            # Kubernetes development workflow

# ============================================================================
# CORE: CLI Utilities
# ============================================================================
brew "jq"                  # JSON processor
brew "yq"                  # YAML processor
brew "gh"                  # GitHub CLI
brew "awscli"              # AWS CLI v2
brew "azure-cli"           # Azure CLI
brew "terraform"           # Infrastructure as code

# ============================================================================
# NOTE: Shell plugins (autosuggestions, syntax-highlighting) are managed by
# zinit in .zshrc - no need for Homebrew versions
# ============================================================================

# ============================================================================
# CORE: Development Utilities
# ============================================================================
brew "ripgrep"             # Fast recursive grep (rg)
brew "fd"                  # Fast find alternative
brew "fzf"                 # Fuzzy finder
brew "bat"                 # cat with syntax highlighting
brew "eza"                 # Modern ls replacement
brew "tldr"                # Simplified man pages
brew "httpie"              # User-friendly HTTP client
brew "git-lfs"             # Git Large File Storage

# ============================================================================
# CORE: System & Process Management
# ============================================================================
brew "htop"                # Interactive process viewer
brew "tmux"                # Terminal multiplexer
brew "tree"                # Directory tree viewer

# ============================================================================
# CORE: Supply Chain Security
# ============================================================================
brew "cosign"              # Container image signing
brew "grype"               # CVE scanner for images
brew "syft"                # SBOM generator

# ============================================================================
# CORE: Data & Databases
# ============================================================================
brew "sqlite"              # Lightweight SQL database
brew "duckdb"              # Embedded analytics database

# ============================================================================
# SPECIALTY: Custom Taps (must be before formulae that use them)
# ============================================================================
tap "dagger/tap"

# ============================================================================
# SPECIALTY: Cross-Platform Tools
# ============================================================================
brew "dagger/tap/container-use"  # Container MCP for coding agents

# ============================================================================
# OPTIONAL: Uncomment if needed (may require source build or manual install)
# ============================================================================
# tap "hauler-dev/homebrew-tap"
# brew "hauler-dev/homebrew-tap/hauler"  # Airgap content management (Rancher)
# tap "valkyrie00/bbrew"
# brew "valkyrie00/bbrew/bbrew"          # Bold Brew TUI (requires gcc to build)

# ============================================================================
# NOTE: The following tools are installed via Wolfi apk or direct download:
# - Docker, Docker Compose (Wolfi native packages)
# - RCC (joshyorko fork - via ror-specialty feature)
# - action-server (Sema4.AI - via ror-specialty feature)
# ============================================================================
